contents/takahashi/docs/drill.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>はじめてのRuby</title>
<!-- 2018-08-14 火 17:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shun Takahashi" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">はじめてのRuby</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. print,puts,pメソッド</a>
<ul>
<li><a href="#sec-1-1">1.1. helloruby.rb</a></li>
<li><a href="#sec-1-2">1.2. helloruby_2.rb</a></li>
<li><a href="#sec-1-3">1.3. p_method.rb</a></li>
</ul>
</li>
<li><a href="#sec-2">2. コマンドラインからのデータの入力</a>
<ul>
<li><a href="#sec-2-1">2.1. print_argv.rb</a></li>
<li><a href="#sec-2-2">2.2. arg_arith.rb</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 変数</a>
<ul>
<li><a href="#sec-3-1">3.1. area_volume.rb</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 条件判断</a>
<ul>
<li><a href="#sec-4-1">4.1. greater_smaller_else.rb</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 繰り返し</a>
<ul>
<li><a href="#sec-5-1">5.1. 1_to_n.rb</a></li>
<li><a href="#sec-5-2">5.2. five_times.rb</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 配列</a>
<ul>
<li><a href="#sec-6-1">6.1. 配列からオブジェクトを取り出す</a></li>
<li><a href="#sec-6-2">6.2. 配列にオブジェクトを格納する</a></li>
<li><a href="#sec-6-3">6.3. 配列の大きさ</a></li>
<li><a href="#sec-6-4">6.4. 配列と繰り返し</a></li>
</ul>
</li>
<li><a href="#sec-7">7. ハッシュ</a>
<ul>
<li><a href="#sec-7-1">7.1. シンボル</a></li>
<li><a href="#sec-7-2">7.2. ハッシュの操作</a></li>
</ul>
</li>
<li><a href="#sec-8">8. 正規表現</a>
<ul>
<li><a href="#sec-8-1">8.1. パターンとマッチング</a></li>
</ul>
</li>
<li><a href="#sec-9">9. ファイルからの読み込み</a>
<ul>
<li><a href="#sec-9-1">9.1. read_text.rb</a></li>
<li><a href="#sec-9-2">9.2. read_line.rb</a></li>
<li><a href="#sec-9-3">9.3. simple_grep.rb</a></li>
</ul>
</li>
<li><a href="#sec-10">10. メソッドの作成</a>
<ul>
<li><a href="#sec-10-1">10.1. hello_ruby2.rb</a></li>
<li><a href="#sec-10-2">10.2. hello_ruby3.rb</a></li>
</ul>
</li>
<li><a href="#sec-11">11. 別のファイルを取り込む</a>
<ul>
<li><a href="#sec-11-1">11.1. ディレクトリ内のファイルの取り込み</a></li>
<li><a href="#sec-11-2">11.2. Rubyの標準ライブラリ</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> print,puts,pメソッド</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> helloruby.rb</h3>
<div class="outline-text-3" id="text-1-1">
<p>
「Hello, Ruby.」という文字列を表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">print 'Hello, Ruby.\n'
</pre>
</div>

<pre class="example">
&gt; answer.rb
Hello, Ruby.
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> helloruby_2.rb</h3>
<div class="outline-text-3" id="text-1-2">
<p>
「Hello, "Ruby".」という文字列を表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">print Hello, \"Ruby\".\n"
</pre>
</div>

<pre class="example">
&gt; answer.rb
Hello, "Ruby".
</pre>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> p_method.rb</h3>
<div class="outline-text-3" id="text-1-3">
<p>
「"Hello,\n\tRuby."」という文字列を表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">p "Hello,\n\tRuby."
</pre>
</div>

<pre class="example">
&gt; answer.rb
"Hello,\n\tRuby."
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> コマンドラインからのデータの入力</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> print_argv.rb</h3>
<div class="outline-text-3" id="text-2-1">
<p>
コマンドラインから5つの引数を受け取り、受け取った順に表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">puts ARGV[0]
puts ARGV[1]
puts ARGV[2]
puts ARGV[3]
puts ARGV[4]
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb 1st 2nd 3rd 4th 5th
1st
2nd
3rd
4th
5th
</pre>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> arg_arith.rb</h3>
<div class="outline-text-3" id="text-2-2">
<p>
コマンドラインから数値を2つ受け取り、その和、差、積、商を表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">num0 = ARGV[0].to_i
num1 = ARGV[1].to_i

sum = num0 + num1
dif = num0 - num1
pro = num0 * num1
quo = num0 / num1

puts sum
puts dif
puts pro
puts quo
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb 5 3 
8
2
15
1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 変数</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> area_volume.rb</h3>
<div class="outline-text-3" id="text-3-1">
<p>
3つの数値をx、y、zとして受け取り、縦x、横y、高さzの直方体の表面積と体積を求め、表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">x = ARGV[0].to_i
y = ARGV[1].to_i
z = ARGV[2].to_i

area = (x * y + y * z + z * x) * 2
volume = x * y * z

print '表面積=', area, "\n"
print '体積=' volume, "\n"
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb 10 20 30
表面積=2200
体積=6000
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 条件判断</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> greater_smaller_else.rb</h3>
<div class="outline-text-3" id="text-4-1">
<p>
1つの数値を受け取り、それが10より大きければ「greater」小さければ「smaller」と表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">a = ARGV[0].to_i

if a &gt;= 10
  print "greater\n"
else
  print "smaller\n"
end
</pre>
</div>

<pre class="example">
&gt;ruby answer.rb 20
greater

&gt;ruby answer.rb 5
smaller
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 繰り返し</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 1_to_n.rb</h3>
<div class="outline-text-3" id="text-5-1">
<p>
1つの数値をnとして受け取り、1からnまでの数を順番に表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">n = ARGV[0].to_i
i = 1
while i &lt;= n
  print i, "\n"
  i += 1
end
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb 5
1
2
3
4
5
</pre>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> five_times.rb</h3>
<div class="outline-text-3" id="text-5-2">
<p>
「All work and no play makes Jack a dull boy.」と5行表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">5.times do
  print "All work and no play makes Jack a dull boy.\n"
end
</pre>
</div>

<pre class="example">
&gt; answer.rb
All work and no play makes Jack a dull boy.
All work and no play makes Jack a dull boy.
All work and no play makes Jack a dull boy.
All work and no play makes Jack a dull boy.
All work and no play makes Jack a dull boy.
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 配列</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 配列からオブジェクトを取り出す</h3>
<div class="outline-text-3" id="text-6-1">
<p>
1つの数値をnとして受け取り、配列のn番目の要素を取り出し、表示するプログラムを作成せよ。ただし、配列はプログラム内で定義し、配列には数値が入るものとする。
</p>

<div class="org-src-container">

<pre class="src src-ruby">nums = [3, 1, 4, 1, 5]

print nums[ARGV[0].to_i]
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb 0
3

&gt; ruby answer.rb 3
1
</pre>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 配列にオブジェクトを格納する</h3>
<div class="outline-text-3" id="text-6-2">
<p>
配列の先頭の要素をコマンドラインに入力した要素に変更するプログラムを作成せよ。
ただし、配列はプログラム内で定義し、配列には数値が入るものとする。
</p>

<div class="org-src-container">

<pre class="src src-ruby">nums = [3, 1, 4, 1, 5]

nums[0] = ARGV[0].to_i

print nums
</pre>
</div>


<pre class="example">
&gt; ruby answer.rb 5
[5, 1, 4, 1, 5]
</pre>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 配列の大きさ</h3>
<div class="outline-text-3" id="text-6-3">
<p>
配列を表示し、その配列の大きさも表示するプログラムを作成せよ。
ただし、配列はプログラム内で定義すること。
</p>

<div class="org-src-container">

<pre class="src src-ruby">nums = [3, 1, 4, 1, 5]

print nums, "\n"

print nums.size, "\n"
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb
[3, 1, 4, 1, 5]
5
</pre>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 配列と繰り返し</h3>
<div class="outline-text-3" id="text-6-4">
<p>
配列全体を表示してから、配列の要素を順に表示するプログラムを作成せよ。
ただし、配列はプログラム内で定義すること。
</p>

<div class="org-src-container">

<pre class="src src-ruby">nums = [3, 1, 4, 1, 5]

print nums, "\n"

nums.each do |n|
  puts n
end
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb
[3, 1, 4, 1, 5]
3
1
4
1
5
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> ハッシュ</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> シンボル</h3>
<div class="outline-text-3" id="text-7-1">
<p>
1つの文字列を受け取り、シンボルに変換して表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">n = ARGV[0]

p n.to_sym
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb hash
:hash
</pre>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> ハッシュの操作</h3>
<div class="outline-text-3" id="text-7-2">
<p>
:name, :furigana というそれぞれのキーに"高橋", "タカハシ"というオブジェクトが格納されているハッシュを作成、表示し、さらに:tel というキーに"000-1234-5678"を格納して再度表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">address = { name: "高橋", furigana: "タカハシ" }

puts address

address[:tel] = "000-1234-5678"

puts address
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb 
{:name=&gt;"高橋", :furigana=&gt;"タカハシ"}
{:name=&gt;"高橋", :furigana=&gt;"タカハシ", :tel=&gt;"000-1234-5678"}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 正規表現</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> パターンとマッチング</h3>
<div class="outline-text-3" id="text-8-1">
<p>
1つの文字列を受け取り、それが「Hello, Ruby」とマッチするなら「match.」マッチしないなら「not match.」と表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">n = /#{ARGV[0]}/

if n =~ "Hello, Ruby."
  print "match.\n"
else
  print "not match\n"
end
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb Ruby
match.

&gt; ruby answer.rb RUBY
not match.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> ファイルからの読み込み</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> read_text.rb</h3>
<div class="outline-text-3" id="text-9-1">
<p>
1つの文字列を受け取り、該当するファイル名のテキストデータを表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">filename = ARGV[0]
text = File.read(filename)
print text
</pre>
</div>

<pre class="example">
&gt;ruby answer.rb [filename]
[text]
</pre>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> read_line.rb</h3>
<div class="outline-text-3" id="text-9-2">
<p>
1つの文字列を受け取り、該当するファイル名のテキストデータを1行ずつ読み取り、表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">filename = ARGV[0]
file = File.open(filename)
file.each_line do |line|
  print line
end
</pre>
</div>

<pre class="example">
</pre>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> simple_grep.rb</h3>
<div class="outline-text-3" id="text-9-3">
<p>
2つの文字列を受け取り、2つ目の文字列に該当するファイル名のテキストデータの中から、1つ目の文字列にマッチする行を出力するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">pattern = Regexp.new(ARGV[0])
filename = ARGV[1]

file = File.open(filename)
file.each_line do |line|
  if pattern =~ line
    print line
  end
end
file.close
</pre>
</div>

<pre class="example">
&gt;ruby answer.rb [pattern] [filename]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> メソッドの作成</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> hello_ruby2.rb</h3>
<div class="outline-text-3" id="text-10-1">
<p>
「Hello, Ruby.」と表示するメソッドhelloを用いて、「Hello, Ruby.」と表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">def hello
  puts 'Hello, Ruby.'
end

hello
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb
Hello, Ruby.
</pre>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> hello_ruby3.rb</h3>
<div class="outline-text-3" id="text-10-2">
<p>
1つの文字列を受け取り、「Hello, [受け取った文字列].」と表示するメソッドhelloを作成し、
2つの文字列を受け取り、「Hello, [受け取った文字列].」と２行表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">def hello(name)
  print 'Hello, ', name, ".\n"
end

hello(ARGV[0])
hello(ARGV[1])
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb Ruby Takahashi
Hello, Ruby.
Hello, Takahashi.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 別のファイルを取り込む</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> ディレクトリ内のファイルの取り込み</h3>
<div class="outline-text-3" id="text-11-1">
<p>
1つの文字列を受け取り、「Hello, [受け取った文字列].」と表示するメソッドhelloが書かれたプログラムhello.rbがある。
</p>

<p>
このプログラムを取り込んで、1つの文字列を受け取り、「Hello, [受け取った文字列].」と表示するプログラムを作成せよ。
</p>


<ul class="org-ul">
<li>hello.rb
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby">def hello(name)
  print 'Hello, ', name, "\n"
end
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby">require_relative "hello"

name = ARGV[0]

hello(name)
</pre>
</div>

<pre class="example">
&gt; answer.rb Ruby
Hello, Ruby.
</pre>
</div>
</div>

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Rubyの標準ライブラリ</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Rubyの標準ライブラリ「date」を用いて、Rubyが誕生した1993年2月24日から、今日までの日数を表示するプログラムを作成せよ。
</p>

<div class="org-src-container">

<pre class="src src-ruby">require "date"

days = Date.today - Date.new(1993, 2, 24)
puts days.to_i
</pre>
</div>

<pre class="example">
&gt; ruby answer.rb
9302
</pre>
<ul class="org-ul">
<li>2018/8/14時点
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shun Takahashi</p>
<p class="date">Created: 2018-08-14 火 17:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
